Revit 2020 API
Generic Class
 Represents the properties of materials.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2018.1
Syntax
C#
public static class Generic
Visual Basic
Public NotInheritable Class Generic
Visual C++
public ref class Generic abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.Generic
See Also
Generic Members
Autodesk.Revit.DB.Visual Namespace